    ;子程序名称:求32位补码的程序
    ;功能:求32位补码
    ;入口参数:AX寄存器放低16位，DX寄存器放高16位
    ;出口参数:AX寄存器放低16位结果，DX寄存器放高16位结果
    ;其他说明:无
    ;=======================================
COMPLEMENT PROC
               push bp            ;保存主程序栈基址
               MOV  bp,sp         ;将当前栈顶作为栈底，建立堆栈框架
    ;用bp寄存器作为堆栈的基址
    ;bp+2获取返回地址IP
    ;bp+4获取返回地址段值(CS)
    ;bp+6获取入口参数
    ;==================子程序代码开始==============
               not  ax            ;低16位的反码
               not  dx            ;高16位的反码
               add  ax,1h         ;低位正常加1
               adc  dx,0          ;高位，带位加1
    ;==================子程序代码结束==============
               MOV  sp,bp         ;释放定义的局部变量的空间(SUB sp,4)
               pop  BP
               RET
COMPLEMENT ENDP